# Fictional Army - Filtrando y ordenando

Importamos las librerías necesarias

In [21]:
%pip install pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\diego gerwig\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\diego gerwig\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\diego gerwig\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\diego gerwig\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\diego gerwig\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\diego gerwig\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

### Step 1. Cread un dataframe con la información de abajo

In [22]:
# Datos de nuestra armada
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, None, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, None, 3, None, 2, None, 2, None, None, 1, 2, None],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [23]:
df = pd.DataFrame(raw_data)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   regiment   12 non-null     object
 1   company    12 non-null     object
 2   deaths     11 non-null     float64
 3   battles    12 non-null     int64
 4   size       12 non-null     int64
 5   veterans   12 non-null     int64
 6   readiness  6 non-null      float64
 7   armored    12 non-null     int64
 8   deserters  12 non-null     int64
 9   origin     12 non-null     object
dtypes: float64(2), int64(5), object(3)
memory usage: 1.1+ KB

In [24]:
print(df)

      regiment company  deaths  battles  size  veterans  readiness  armored  \
0   Nighthawks     1st   523.0        5  1045         1        1.0        1
1   Nighthawks     1st    52.0       42   957         5        NaN        0
2   Nighthawks     2nd    25.0        2  1099        62        3.0        1
3   Nighthawks     2nd   616.0        2  1400        26        NaN        1
4     Dragoons     1st    43.0        4  1592        73        2.0        0
5     Dragoons     1st   234.0        7  1006        37        NaN        1
6     Dragoons     2nd   523.0        8   987       949        2.0        0
7     Dragoons     2nd    62.0        3   849        48        NaN        1
8       Scouts     1st     NaN        4   973        48        NaN        0
9       Scouts     1st    73.0        7  1005       435        1.0        0
10      Scouts     2nd    37.0        8  1099        63        2.0        1
11      Scouts     2nd    35.0        9  1523       345        NaN        1

    deserters      origin
0           4     Arizona
1          24  California
2          31       Texas
3           2     Florida
4           3       Maine
5           4        Iowa
6          24      Alaska
7          31  Washington
8           2      Oregon
9           3     Wyoming
10          2    Louisana
11          3     Georgia

### Step 2. Buscad valores faltantes

In [25]:
df_missing_values = df.isnull()
print(df_missing_values)

    regiment  company  deaths  battles   size  veterans  readiness  armored  \
0      False    False   False    False  False     False      False    False
1      False    False   False    False  False     False       True    False
2      False    False   False    False  False     False      False    False
3      False    False   False    False  False     False       True    False
4      False    False   False    False  False     False      False    False
5      False    False   False    False  False     False       True    False
6      False    False   False    False  False     False      False    False
7      False    False   False    False  False     False       True    False
8      False    False    True    False  False     False       True    False
9      False    False   False    False  False     False      False    False
10     False    False   False    False  False     False      False    False
11     False    False   False    False  False     False       True    False

    deserters  origin
0       False   False
1       False   False
2       False   False
3       False   False
4       False   False
5       False   False
6       False   False
7       False   False
8       False   False
9       False   False
10      False   False
11      False   False

In [26]:
df_missing_values = df.isnull().sum()
print(df_missing_values)

regiment     0
company      0
deaths       1
battles      0
size         0
veterans     0
readiness    6
armored      0
deserters    0
origin       0
dtype: int64

### Step 3. Eliminaremos aquellos que superen un umbral de 30% de datos faltantes

In [27]:
threshold = int((0.30) * len(df.columns))

columns_to_drop = df_missing_values[df_missing_values > threshold].index

print(columns_to_drop)

Index(['readiness'], dtype='object')

In [28]:
df_cleaned = df.drop(columns=columns_to_drop)

print(df_cleaned)

      regiment company  deaths  battles  size  veterans  armored  deserters  \
0   Nighthawks     1st   523.0        5  1045         1        1          4
1   Nighthawks     1st    52.0       42   957         5        0         24
2   Nighthawks     2nd    25.0        2  1099        62        1         31
3   Nighthawks     2nd   616.0        2  1400        26        1          2
4     Dragoons     1st    43.0        4  1592        73        0          3
5     Dragoons     1st   234.0        7  1006        37        1          4
6     Dragoons     2nd   523.0        8   987       949        0         24
7     Dragoons     2nd    62.0        3   849        48        1         31
8       Scouts     1st     NaN        4   973        48        0          2
9       Scouts     1st    73.0        7  1005       435        0          3
10      Scouts     2nd    37.0        8  1099        63        1          2
11      Scouts     2nd    35.0        9  1523       345        1          3

        origin
0      Arizona
1   California
2        Texas
3      Florida
4        Maine
5         Iowa
6       Alaska
7   Washington
8       Oregon
9      Wyoming
10    Louisana
11     Georgia

### Step 4. Rellenad los datos faltantes con la media de la serie

In [33]:
numeric_columns = df_cleaned.select_dtypes(include='number').columns
df_cleaned[numeric_columns] = df_cleaned[numeric_columns].fillna(df_cleaned[numeric_columns].mean())

print(df_cleaned)

      regiment company      deaths  battles  size  veterans  armored  \
0   Nighthawks     1st  523.000000        5  1045         1        1
1   Nighthawks     1st   52.000000       42   957         5        0
2   Nighthawks     2nd   25.000000        2  1099        62        1
3   Nighthawks     2nd  616.000000        2  1400        26        1
4     Dragoons     1st   43.000000        4  1592        73        0
5     Dragoons     1st  234.000000        7  1006        37        1
6     Dragoons     2nd  523.000000        8   987       949        0
7     Dragoons     2nd   62.000000        3   849        48        1
8       Scouts     1st  202.090909        4   973        48        0
9       Scouts     1st   73.000000        7  1005       435        0
10      Scouts     2nd   37.000000        8  1099        63        1
11      Scouts     2nd   35.000000        9  1523       345        1

    deserters      origin
0           4     Arizona
1          24  California
2          31       Texas
3           2     Florida
4           3       Maine
5           4        Iowa
6          24      Alaska
7          31  Washington
8           2      Oregon
9           3     Wyoming
10          2    Louisana
11          3     Georgia

### Step 5. Marcad como índice la columna `origin`

In [29]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [30]:
df

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523.0,5,1045,1,1.0,1,4,Arizona
1,Nighthawks,1st,52.0,42,957,5,NaN,0,24,California
2,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31,Texas
3,Nighthawks,2nd,616.0,2,1400,26,NaN,1,2,Florida
4,Dragoons,1st,43.0,4,1592,73,2.0,0,3,Maine
5,Dragoons,1st,234.0,7,1006,37,NaN,1,4,Iowa
6,Dragoons,2nd,523.0,8,987,949,2.0,0,24,Alaska
7,Dragoons,2nd,62.0,3,849,48,NaN,1,31,Washington
8,Scouts,1st,NaN,4,973,48,NaN,0,2,Oregon
9,Scouts,1st,73.0,7,1005,435,1.0,0,3,Wyoming
10,Scouts,2nd,37.0,8,1099,63,2.0,1,2,Louisana
11,Scouts,2nd,35.0,9,1523,345,NaN,1,3,Georgia

In [31]:
df.set_index('origin')

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523.0,5,1045,1,1.0,1,4
California,Nighthawks,1st,52.0,42,957,5,NaN,0,24
Texas,Nighthawks,2nd,25.0,2,1099,62,3.0,1,31
Florida,Nighthawks,2nd,616.0,2,1400,26,NaN,1,2
Maine,Dragoons,1st,43.0,4,1592,73,2.0,0,3
Iowa,Dragoons,1st,234.0,7,1006,37,NaN,1,4
Alaska,Dragoons,2nd,523.0,8,987,949,2.0,0,24
Washington,Dragoons,2nd,62.0,3,849,48,NaN,1,31
Oregon,Scouts,1st,NaN,4,973,48,NaN,0,2
Wyoming,Scouts,1st,73.0,7,1005,435,1.0,0,3
Louisana,Scouts,2nd,37.0,8,1099,63,2.0,1,2
Georgia,Scouts,2nd,35.0,9,1523,345,NaN,1,3

### Step 6. Elegid 'deaths', 'size' y 'deserters' de las filas de Maine y Alaska

### Step 7. Obtened los datos de las filas 3 a 7 y columnas 3 a 6

### Step 8. Mostrad los datos de la 4 fila en adelante

### Step 9. Mostrad los datos hasta la cuarta fila

### Step 10. Mostrad solo las columnas de la 3 a la 7

### Step 11. Buscad las filas con más de 50 muertes informadas

### Step 12. Mostrad las filas con muertes comprendidas entre 50 y 500

### Step 13. Buscad regimientos que no se llamen "Dragoons"

### Step 14. Buscad la información relativa a los origenes Texas y Arizona